** star 1
 - <2020-12-08 Tue 19:24>
#+BEGIN_SRC cpp :results output
#include <stdio.h>

int main() {
  FILE *f = fopen("01.txt", "r");
  int a, b;
  while (1 == fscanf(f, "%d", &a)) {
    FILE *f2 = fopen("01.txt", "r");
    while (1 == fscanf(f2, "%d", &b)) {
      if (a + b == 2020) {
        printf("=%d\n", a*b);
        return 0;
      }
    }
    fclose(f2);
  }
  printf("sdasd\n");
  return 0;
}
#+END_SRC

#+RESULTS:
: =471019
 - <2020-12-08 Tue 19:28>

** star 2
- <2020-12-08 Tue 19:28>
#+BEGIN_SRC cpp :results output
#include <stdio.h>

int main() {
  FILE *f = fopen("01.txt", "r");
  int a, b, c;
  while (1 == fscanf(f, "%d", &a)) {
    FILE *f2 = fopen("01.txt", "r");
    while (1 == fscanf(f2, "%d", &b)) {
      FILE *f3 = fopen("01.txt", "r");
      while (1 == fscanf(f3, "%d", &c)) {
        if (a + b + c == 2020) {
          printf("=%d\n", a*b*c);
          return 0;
          }
      }
      fclose(f3);
    }
    fclose(f2);
  }
  printf("sdasd\n");
  return 0;
}
#+END_SRC

#+RESULTS:
: =103927824
 - <2020-12-08 Tue 19:30>
** star 1
<2020-12-08 Tue 19:30>
#+BEGIN_SRC cpp :results output
#include <stdio.h>
int main() {
  FILE *f = fopen("02.txt", "r");
  int min, max;
  char c;
  char password[200] = {0};
  int valids = 0;
  while (4 == fscanf(f, "%d-%d %c: %s", &min, &max, &c, password)) {
    //printf("%d-%d %c: '%s'\n", min, max, c, password);

    int count = 0;
    for (int i = 0; password[i]; i++) {
      if (password[i] == c) count++;
    }
    if (count >= min && count <= max) {
      valids++;
    }
  }
  printf("= %d\n", valids);
  return 0;
}
#+END_SRC

#+RESULTS:
: = 550

- <2020-12-08 Tue 19:40>
** star 2
- <2020-12-08 Tue 19:40>
#+BEGIN_SRC cpp :results output
#include <stdio.h>
int main() {
  FILE *f = fopen("02.txt", "r");
  int min, max;
  char c;
  char password[200] = {0};
  int valids = 0;
  while (4 == fscanf(f, "%d-%d %c: %s", &min, &max, &c, password)) {
    //printf("%d-%d %c: '%s'\n", min, max, c, password);
    if (password[min-1] == c ^ password[max-1] == c) valids++;
  }
  printf("= %d\n", valids);
  return 0;
}
#+END_SRC

#+RESULTS:
: = 634


- <2020-12-08 Tue 19:41>
** star 1
 - <2020-12-08 Tue 19:42>
#+BEGIN_SRC cpp :results output
  #include <stdio.h>
  int main() {
    FILE *f = fopen("03.txt", "r");
    char map[1000][1000] = {0};
    char c;
    printf("1\n");
    int width = 0;
    {
      int x = 0, y = 0;
      while ((c = fgetc(f)) != EOF) {
        if (c == '\n') { map[y][x] = 0; width = x; x = 0; y++; }
        else { map[y][x] = c; x++; }
      }
    }

    int trees = 0;
    int x = 0, y = 0;
    while (map[y][0]) {
      x = (x+3) % width; y += 1;
      if (map[y][x] == '#') trees++;
    }

    printf("=%d\n", trees);
    return 0;
  }
#+END_SRC

#+RESULTS:
: 1
: =156

 - <2020-12-08 Tue 19:54>
** star 2
 - <2020-12-08 Tue 19:54>
#+BEGIN_SRC cpp :results output
  #include <stdio.h>
  long trees(char map[1000][1000], int width, int dx, int dy) {
    int trees = 0;
    int x = 0, y = 0;
    while (map[y][0]) {
      x = (x+dx) % width; y += dy;
      if (map[y][x] == '#') trees++;
    }
    return trees;
  }
  int main() {
    FILE *f = fopen("03.txt", "r");
    char map[1000][1000] = {0};
    char c;
    printf("1\n");
    int width = 0;
    {
      int x = 0, y = 0;
      while ((c = fgetc(f)) != EOF) {
        if (c == '\n') { map[y][x] = 0; width = x; x = 0; y++; }
        else { map[y][x] = c; x++; }
      }
    }
    
    printf("=%ld\n", trees(map, width, 1, 1) 
                  * trees(map, width, 3, 1) 
                  * trees(map, width, 5, 1) 
                  * trees(map, width, 7, 1) 
                  * trees(map, width, 1, 2));
    //printf("=%d\n", trees);
    return 0;
  }
#+END_SRC

#+RESULTS:
: 1
: =3521829480

 - <2020-12-08 Tue 19:58>
** star 1
 - <2020-12-09 Wed 17:23>
#+BEGIN_SRC cpp :results output
  #include <stdio.h>
  #include <string.h>
  int main() {
    FILE *f = fopen("04.txt", "r");
    char line[200];
    int linei = 0;
    int state = 0;
    int byr, iyr, eyr, hgt, hcl, ecl, pid;
    byr = iyr = eyr = hgt = hcl = ecl = pid = 0;
    int valids = 0;
    int c;
    while (c = fgetc(f)) {
      line[linei++] = c;
      if (c == EOF || (line[linei-1] == '\n' && line[linei-2] == '\n')) {
        line[linei-2] = 0;
        char tag[20];
        int tagi = 0;
        for (int i = 0; i < linei; i++) {
          if (line[i] >= 'a' && line[i] <= 'z')
            tag[tagi++] = line[i];
          else if (line[i] == ':') {
            tag[tagi] = 0;
            tagi = 0;
            if (0 == strcmp(tag, "byr")) byr = 1;
            if (0 == strcmp(tag, "iyr")) iyr = 1;
            if (0 == strcmp(tag, "eyr")) eyr = 1;
            if (0 == strcmp(tag, "hgt")) hgt = 1;
            if (0 == strcmp(tag, "hcl")) hcl = 1;
            if (0 == strcmp(tag, "ecl")) ecl = 1;
            if (0 == strcmp(tag, "pid")) pid = 1;
            for (; line[i] != ' ' && line[i] != '\n'; i++);
          }
        }
        // printf("\n'%s'\n", line);
        // printf("     %d, %d, %d, %d, %d, %d, %d\n", byr, iyr, eyr, hgt, hcl, ecl, pid);
        if (byr && iyr && eyr && hgt && hcl && ecl && pid) {
          // printf("valid\n");
          valids++;
        } else {
          // printf("    invalid\n");
        }
        byr = iyr = eyr = hgt = hcl = ecl = pid = 0;
        linei = 0;
      }
      if (c == EOF) break;
    }
    printf("= %d\n", valids);
  return 0;
  }
#+END_SRC

#+RESULTS:
: = 219

 - 227 too high
 - 228 too high
 - 219 <2020-12-09 Wed 17:51>
** part 2 
#+BEGIN_SRC cpp :results output
  #include <stdio.h>
  #include <stdlib.h>
  #include <string.h>
  int main() {
    FILE *f = fopen("04.txt", "r");
    char line[200];
    int linei = 0;
    int state = 0;
    int byr, iyr, eyr, hgt, hcl, ecl, pid;
    int valids = 0;
    int c;
    while (c = fgetc(f)) {
      line[linei++] = c;
      if (c == EOF || (line[linei-1] == '\n' && line[linei-2] == '\n')) {
        line[linei-2] = 0;
        byr = iyr = eyr = hgt = hcl = ecl = pid = 0;
        char tag[20];
        int tagi = 0;
        for (int i = 0; i < linei; i++) {
          if (line[i] >= 'a' && line[i] <= 'z')
            tag[tagi++] = line[i];
          else if (line[i] == ':') {
            tag[tagi] = 0;
            tagi = 0;
            char value[100];
            int valuei = 0;
            i++;
            for (; line[i] != ' ' && line[i] != '\n' && i < linei-2; i++)
              value[valuei++] = line[i];
            value[valuei] = 0;
            // printf("          '%s'='%s'%d\n", tag, value, valuei);

            if (0 == strcmp(tag, "byr")) {
              int v = atoi(value);
              if (v >= 1920 && v <= 2002) byr++;
            }
            if (0 == strcmp(tag, "iyr")) {
              int v = atoi(value);
              if (v >= 2010 && v <= 2020) iyr++;
            }
            if (0 == strcmp(tag, "eyr")) {
              int v = atoi(value);
              if (v >= 2020 && v <= 2030) eyr++;
            }
            if (0 == strcmp(tag, "hgt")) {
              int v = atoi(value);
              // printf("      hgt '%d'  '%c %c\n", v, value[valuei-2], value[valuei-1]);
              if ((value[valuei-2] == 'c' && value[valuei-1] == 'm' && v >= 150 && v <= 193)
                  || (value[valuei-2] == 'i' && value[valuei-1] == 'n' && v >= 59 && v <= 76)) hgt++;
            }
            if (0 == strcmp(tag, "hcl")) {
              if (value[0] == '#') {
                int good = 1;
                for (int j = 1; j < 7; j++) {
                if (!((value[j] >= 'a' && value[j] <= 'f') || (value[j] >= '0' && value[j] <= '9')))
                  good = 0;
                  break;
                }
                if (good) hcl++;
              }
            }
            if (0 == strcmp(tag, "ecl")) {
              if (0 == strcmp(value, "amb") || 0 == strcmp(value, "blu") || 0 == strcmp(value, "brn") 
              || 0 == strcmp(value, "gry") || 0 == strcmp(value, "grn") || 0 == strcmp(value, "hzl") 
              || 0 == strcmp(value, "oth"))
                ecl++;
            }
            if (0 == strcmp(tag, "pid")) {
              int good = 1;
              for (int j = 0; j < 9; j++)
                if (!(value[j] >= '0' && value[j] <= '9')) { good = 0; break; }
              if (good) pid ++;
            }
          }
        }
        // printf("'%s'\n", line);
        // printf("     byr=%d, iyr=%d, eyr=%d, hgt=%d, hcl=%d, ecl=%d, pid=%d\n", byr, iyr, eyr, hgt, hcl, ecl, pid);
        if (byr && iyr && eyr && hgt && hcl && ecl && pid) {
          // printf("valid\n");
          valids++;
        } else {
          // printf("    invalid\n");
        }
        // printf("\n");
        linei = 0;
      }
      if (c == EOF) break;
    }
    printf("= %d\n", valids);
  return 0;
  }
#+END_SRC

#+RESULTS:
: = 128

- 128 too high <2020-12-09 Wed 18:14>
** part 2 B
#+BEGIN_SRC cpp :results output
  #include <stdio.h>
  #include <stdlib.h>
  #include <string.h>

  int main() {
      FILE *f = fopen("04.txt", "r");
      char line[1000] = {0};
      int linei = 0;
      int valids = 0;
      while (true) {
          int c = fgetc(f);
          line[linei++] = c;
          if (linei >= 2 && (c == EOF || (line[linei-1] == '\n' && line[linei-2] == '\n'))) {
              line[linei-1] = 0;
              int byr = 0, iyr = 0, eyr = 0, hgt = 0, hcl = 0, ecl = 0, pid = 0;
              int i = 0;
              long pidval = -1;
              while (i < linei - 1) {
                  while (line[i] == ' ' || line[i] == '\n') i++;
                  char tag[200];
                  int tagi = 0;
                  while (line[i] != ':') {
                      tag[tagi++] = line[i];
                      i++;
                  }
                  tag[tagi] = 0;
                  i++;
                  char val[200];
                  int vali = 0;
                  while (line[i] != ' ' && line[i] != '\n' && i < linei) {
                      val[vali++] = line[i];
                      i++;
                  }
                  val[vali] = 0;
                  while (i < linei && (line[i] == ' ' || line[i] == '\n')) i++;

                  // printf("'%s'='%s' ", tag, val);
                  if (0 == strcmp(tag, "byr")) {
                      int v = atoi(val);
                      if (v >= 1920 && v <= 2002) byr++;
                  }
                  if (0 == strcmp(tag, "iyr")) {
                      int v = atoi(val);
                      if (v >= 2010 && v <= 2020) iyr++;
                  }
                  if (0 == strcmp(tag, "eyr")) {
                      int v = atoi(val);
                      if (v >= 2020 && v <= 2030) eyr++;
                  }
                  if (0 == strcmp(tag, "hgt")) {
                      int v = atoi(val);
                      if ((val[vali-2] == 'c' && val[vali-1] == 'm' && v >= 150 && v <= 193)
                       || (val[vali-2] == 'i' && val[vali-1] == 'n' && v >= 59 && v <= 76))
                         hgt++;
                  }
                  if (0 == strcmp(tag, "hcl")) {
                      if (val[0] == '#') {
                        int good = 1;
                        for (int j = 1; j < 7; j++)
                          if (!((val[j] >= 'a' && val[j] <= 'f') || (val[j] >= '0' && val[j] <= '9'))) {
                            good = 0; break;
                          }
                        if (good) hcl++;
                      }
                  }
                  if (0 == strcmp(tag, "ecl")) {
                     if (0 == strcmp(val, "amb") || 0 == strcmp(val, "blu") || 0 == strcmp(val, "brn") || 
                     0 == strcmp(val, "gry") || 0 == strcmp(val, "grn") || 0 == strcmp(val, "hzl") || 
                     0 == strcmp(val, "oth"))
                         ecl++;
                  }
                  if (0 == strcmp(tag, "pid")) {
                      int good = 1;
                      for (int j = 0; j < 9; j++) 
                        if (!(val[j] >= '0' && val[j] <= '9')) {
                          good = 0; break;
                        }
                      if (good && val[9] == 0) pid++;
                      pidval = atol(val);
                  }
              }
              if (byr && iyr && eyr && hgt && hcl && ecl && pid) valids++;
              // printf("\nbyr=%d iyr=%d eyr=%d hgt=%d hcl=%d ecl=%d pid=%d\n\n", byr, iyr, eyr, hgt, hcl, ecl, pid);
              linei = 0;
          }
          if (c == EOF) break;
      }

      printf("= %d\n", valids);
      return 0;
  }
#+END_SRC

#+RESULTS:
: = 127

 - 12 wrong <2020-12-09 Wed 19:10>
 - 127 <2020-12-09 Wed 19:27>
** part 1
 - <2020-12-10 Thu 20:17>
#+BEGIN_SRC cpp :results output
  #include <stdio.h>
  int main() {
      FILE *f = fopen("05.txt", "r");

      int highestSeat = 0;

      int rowstart = 0;
      int rowend = 128;
      int colstart = 0;
      int colend = 8;
      for (int c = fgetc(f); c != EOF; c = fgetc(f)) {
         //printf("## c=%c: row=%d..%d\n", c, rowstart, rowend);
          switch (c) {
          case 'F':
              rowend = rowstart + (rowend-rowstart)/2;
              break;
          case 'B':
              rowstart = rowstart + (rowend-rowstart)/2;
              break;
          case 'R':
              colstart = colstart + (colend-colstart)/2;
              break;
          case 'L':
              colend = colstart + (colend-colstart)/2;
              break;
          }
          if (colstart == colend - 1) {
              int seat = rowstart * 8 + colstart;
              //printf("## %3d,%3d=%3d\n", rowstart, colstart, seat);
              if (seat > highestSeat) highestSeat = seat;
              rowstart = 0;
              rowend = 128;
              colstart = 0;
              colend = 8;
          }
      }


      printf("= %d\n", highestSeat);
      return 0;
  }
#+END_SRC

#+RESULTS:
: = 813

 - 157 too low <2020-12-10 Thu 20:35>
 - 813 correct <2020-12-10 Thu 20:38>

** part 1
 - <2020-12-12 Sat 14:14>
#+BEGIN_SRC cpp :results output
#include <stdio.h>
int main() {
  FILE *f = fopen("06.txt", "r");
  int sum;
  int yess[300] = {0};
  int prevc = 0;
  while (true) {
    int c = fgetc(f);
    
    if (c >= 'a' && c <= 'z') {
      yess[c]++;
    }
    if (c == EOF || (c == '\n' && prevc == '\n')) {
      int groupyess = 0;
      for (int i = 0; i < 300; i++) {
        if (yess[i]) groupyess++;
        yess[i] = 0;
      }
      sum += groupyess;
    }
    if (c == EOF) break;
    prevc = c;
  }

  printf("= %d\n", sum);
  return 0;
}
#+END_SRC

#+RESULTS:
: = 6249


 - <2020-12-12 Sat 14:21>
** part 2
#+BEGIN_SRC cpp :results output
#include <stdio.h>
int main() {
  FILE *f = fopen("06.txt", "r");
  int sum;
  int yess[300] = {0};
  int groupsize = 0;
  int prevc = 0;
  while (true) {
    int c = fgetc(f);
    
    if (c >= 'a' && c <= 'z') {
      yess[c]++;
    }
    if (c == '\n') groupsize++;
    if (c == EOF || (c == '\n' && prevc == '\n')) {
      groupsize--;
      int groupyess = 0;
      for (int i = 0; i < 300; i++) {
        if (yess[i] == groupsize) groupyess++;
        yess[i] = 0;
      }
      sum += groupyess;
      //printf("## %d/%d sum=%d\n", groupyess, groupsize, sum);
      groupsize = 0;
    }
    if (c == EOF) break;
    prevc = c;
  }

  printf("= %d\n", sum);
  return 0;
}
#+END_SRC

#+RESULTS:
: = 3103


 - 1222 too low <2020-12-12 Sat 14:24>
 - 3093 too low <2020-12-12 Sat 14:25>
 - 3103 correct (add newline at end of input) <2020-12-12 Sat 14:27>
** part 1
 - <2020-12-12 Sat 14:27>
#+BEGIN_SRC cpp :results output
  #include <stdio.h>
  #include <string.h>
  #include <strings.h>
  int main() {
    FILE *f = fopen("07.txt", "r");
    int output = 0;

    char *bagandcontainsbags[1000][10];
    int bagi = 0;
    char line[1000];
    while (fgets(line, sizeof(line), f)) {
      char *ptr = strstr(line, " contain ");
      ptr[0] = 0;
      int bagi2 = 0;
      bagandcontainsbags[bagi][bagi2++] = strdup(line);
      ptr += strlen(" contain 6 ");
      while (true) {
        char *ptr2 = strstr(ptr, ", ");
        if (ptr2 == NULL) {
          ptr2 = strstr(ptr, ".");
          ptr2[0] = 0;
          bagandcontainsbags[bagi][bagi2++] = strdup(ptr);
          break;
        } else {
          ptr2[0] = 0;
          bagandcontainsbags[bagi][bagi2++] = strdup(ptr);
          ptr = ptr2 + strlen(", 5 ");
        }
      }
      bagandcontainsbags[bagi][bagi2++] = NULL;
      bagi++;
    }
    bagandcontainsbags[bagi][0] = NULL;

    // remove bag or bags suffix
    for (int bagi = 0; bagandcontainsbags[bagi][0]; bagi++) {
      for (int bagi2 = 0; bagandcontainsbags[bagi][bagi2]; bagi2++) {
        rindex(bagandcontainsbags[bagi][bagi2], ' ')[0] = 0;
      }
    }

    char *bagscontains[10000];
    int bagscontainsi = 0;
    bagscontains[bagscontainsi++] = "shiny gold";

    int bagscontainsiold = 0;
    while (bagscontainsiold != bagscontainsi) {
    bagscontainsiold = bagscontainsi;

    // for (int i = 0; i < bagscontainsiold; i++)
    //   printf("'%s', ", bagscontains[i]);
    // printf("\n");

    for (int bagi = 0; bagandcontainsbags[bagi][0]; bagi++) {
      for (int bagi2 = 1; bagandcontainsbags[bagi][bagi2]; bagi2++) {
        for (int i = 0; i < bagscontainsiold; i++) {
          if (0 == strcmp(bagscontains[i], bagandcontainsbags[bagi][bagi2])) {
            int alreadyadded = 0;
            for (int j = 0; j < bagscontainsi; j++) {
              if (0 == strcmp(bagandcontainsbags[bagi][0], bagscontains[j])) {
                alreadyadded = 1;
                break;
              }
            }
            if (!alreadyadded) {
              bagscontains[bagscontainsi++] = bagandcontainsbags[bagi][0];
            }
          }
        }
      }
    }
    }

    printf("= %d\n", bagscontainsi - 1);
    return 0;
  }
#+END_SRC

#+RESULTS:
: = 233


 - 106 too low <2020-12-12 Sat 15:10>
 - 233 correct <2020-12-12 Sat 15:14>
** part 2
#+BEGIN_SRC cpp :results output
  #include <stdio.h>
  #include <string.h>
  #include <strings.h>

  int bagsamount(char *bag, char *bagandcontainsbags[1000][10], int bagandcontainsbagsamount[1000][10]) {
    int output = 1;
    for (int bagi = 0; bagandcontainsbags[bagi][0]; bagi++) {
      //printf("### '%s' == '%s' = %d\n", bagandcontainsbags[bagi][0], bag, strcmp(bagandcontainsbags[bagi][0], bag));
      if (0 == strcmp(bagandcontainsbags[bagi][0], bag)) {
        for (int bagi2 = 1; bagandcontainsbags[bagi][bagi2]; bagi2++) {
          //printf("## '%s' has %d '%s'\n", bag, bagandcontainsbagsamount[bagi][bagi2], bagandcontainsbags[bagi][bagi2]);
          output += bagandcontainsbagsamount[bagi][bagi2] * 
            bagsamount(bagandcontainsbags[bagi][bagi2], bagandcontainsbags, bagandcontainsbagsamount);
        }
      }
    }
    return output;
  }

  int main() {
    FILE *f = fopen("07.txt", "r");
    int output = 0;

    char *bagandcontainsbags[1000][10];
    int bagandcontainsbagsamount[1000][10];
    int bagi = 0;
    char line[1000];
    while (fgets(line, sizeof(line), f)) {
      char *ptr = strstr(line, " contain ");
      ptr[0] = 0;
      int bagi2 = 0;
      bagandcontainsbags[bagi][bagi2++] = strdup(line);
      ptr += strlen(" contain ");
      if (0 == strcmp(ptr, "no other bags.\n")) {
        continue;
      }
      while (true) {
        bagandcontainsbagsamount[bagi][bagi2] = ptr[0] - '0';
        ptr += strlen("5 ");
        char *ptr2 = strstr(ptr, ", ");
        if (ptr2 == NULL) {
          ptr2 = strstr(ptr, ".");
          ptr2[0] = 0;
          bagandcontainsbags[bagi][bagi2++] = strdup(ptr);
          break;
        } else {
          ptr2[0] = 0;
          bagandcontainsbags[bagi][bagi2++] = strdup(ptr);
          ptr = ptr2 + strlen(", ");
        }
      }
      bagandcontainsbags[bagi][bagi2++] = NULL;
      bagi++;
    }
    bagandcontainsbags[bagi][0] = NULL;

    // remove bag or bags suffix
    for (int bagi = 0; bagandcontainsbags[bagi][0]; bagi++) {
      for (int bagi2 = 0; bagandcontainsbags[bagi][bagi2]; bagi2++) {
        rindex(bagandcontainsbags[bagi][bagi2], ' ')[0] = 0;
      }
    }

    // for (int bagi = 0; bagandcontainsbags[bagi][0]; bagi++) {
    //   printf("## '%s' contains: ", bagandcontainsbags[bagi][0]);
    //   for (int bagi2 = 1; bagandcontainsbags[bagi][bagi2]; bagi2++) {
    //     printf("%d '%s', ", bagandcontainsbagsamount[bagi][bagi2], bagandcontainsbags[bagi][bagi2]);
    //   }
    //   printf("\n");
    // }

    printf("= %d\n", bagsamount("shiny gold", bagandcontainsbags, bagandcontainsbagsamount) - 1);
    return 0;
  }
#+END_SRC

#+RESULTS:
: = 421550

 - 421550 correct <2020-12-12 Sat 15:38>
** part 1
 - <2020-12-12 Sat 20:49>
#+BEGIN_SRC cpp :results output
  #include <stdio.h>
  #include <string.h>
  int main() {
    FILE *f = fopen("08.txt", "r");
    char *program[10000];
    int programi = 0;
    char line[200];
    while (fgets(line, sizeof(line), f)) {
      program[programi++] = strdup(line);
      program[programi-1][strlen(program[programi-1])-1] = 0;
    }

    // for (int i = 0; i < programi; i++)
    //   printf("'%s'\n", program[i]);

    int pc = 0;
    int acc = 0;

    int pcsseen[10000];
    int pcsseeni = 0;
  
    while (true) {

      for (int i = 0; i < pcsseeni; i++) {
        if (pc == pcsseen[i]) {
          printf("= %d\n", acc);
          return 0;
        }
      }

      pcsseen[pcsseeni++] = pc;

      int arg = 0;
      if (1 == sscanf(program[pc], "nop %d", &arg)) {
        pc++;
      } else if (1 == sscanf(program[pc], "acc %d", &arg)) {
        acc += arg;
        pc++;
      } else if (1 == sscanf(program[pc], "jmp %d", &arg)) {
        pc += arg;
      }
    }

    printf("Sdfs\n");
    return 0;
  }
#+END_SRC

#+RESULTS:
: = 1420

 - 1420 correct <2020-12-12 Sat 20:59>
** part 2
#+BEGIN_SRC cpp :results output
  #include <stdio.h>
  #include <stdlib.h>
  #include <string.h>
  int main() {
    FILE *f = fopen("08.txt", "r");
    char *program[10000];
    int programi = 0;
    char line[200];
    while (fgets(line, sizeof(line), f)) {
      program[programi++] = strdup(line);
      program[programi-1][strlen(program[programi-1])-1] = 0;
    }

    // for (int i = 0; i < programi; i++)
    //   printf("'%s'\n", program[i]);



    for (int j = 0; j < programi; j++) {
      int arg = 0;
      //printf("j=%d\n", j);
      // swap ins
      if (1 == sscanf(program[j], "nop %d", &arg)) {
        sprintf(line, "jmp %d", arg);
        free(program[j]);
        program[j] = strdup(line);
      } else if (1 == sscanf(program[j], "jmp %d", &arg)) {
        sprintf(line, "nop %d", arg);
        free(program[j]);
        program[j] = strdup(line);
      } else {
        continue;
      }

    int pc = 0;
    int acc = 0;
    int pcsseen[10000];
    int pcsseeni = 0;
    while (true) {
      if (pc == programi) {
        printf("= %d\n", acc);
        return 0;
      }
      if (pc < 0 || pc >= programi) {
        printf("no1\n");
        break;
      }

      int seenbefore = 0;
      for (int i = 0; i < pcsseeni; i++) {
        if (pc == pcsseen[i]) {
          //printf("no2\n");
          seenbefore = 1;
          //printf("= %d\n", acc);
          break;
        }
      }
      if (seenbefore) break;

      pcsseen[pcsseeni++] = pc;

      //printf("## '%s' acc=%d, pc=%d\n", program[pc], acc, pc);
      if (1 == sscanf(program[pc], "nop %d", &arg)) {
        pc++;
      } else if (1 == sscanf(program[pc], "acc %d", &arg)) {
        acc += arg;
        pc++;
      } else if (1 == sscanf(program[pc], "jmp %d", &arg)) {
        pc += arg;
      }
    }
     // swap back
      if (1 == sscanf(program[j], "nop %d", &arg)) {
        sprintf(line, "jmp %d", arg);
        free(program[j]);
        program[j] = strdup(line);
      } else if (1 == sscanf(program[j], "jmp %d", &arg)) {
        sprintf(line, "nop %d", arg);
        free(program[j]);
        program[j] = strdup(line);
      }
    }

    printf("Sdfs\n");
    return 0;
  }
#+END_SRC

#+RESULTS:
: = 1245

 - 1245 correct <2020-12-12 Sat 21:14>
** part 1
 - <2020-12-12 Sat 21:21>
#+BEGIN_SRC cpp :results output
  #include <stdio.h>
  #include <stdlib.h>
  int main() {
    int numberssize = 30;
    long numbers[numberssize];
    int numbersistart = 0;
    int numbersiend = 0;

    FILE *f = fopen("09.txt", "r");
    char line[100];
    int seen = 0;
    while (fgets(line, sizeof(line), f)) {
      long number = atol(line);
      // printf("## %ld, old=%d..%d: ", number, numbersistart, numbersiend);
      // for (int i = numbersistart; i != numbersiend; i = (i + 1) % numberssize)
      //   printf("%ld, ", numbers[i]);
      // printf("\n");
      if (seen++ >= 25) {
        int valid = 0;
        for (int i = numbersistart; i != numbersiend; i = (i + 1) % numberssize) {
          for (int j = numbersistart; j != numbersiend; j = (j + 1) % numberssize) {
            if (numbers[i] + numbers[j] == number) { valid = 1; break; }
          }
        }
        if (!valid) {
         printf("= %ld\n", number);
         return 0;
        }

        numbersistart = (numbersistart+1) % numberssize;
      }
      numbers[numbersiend] = number;
      numbersiend = (numbersiend+1) % numberssize;
      //if (seen > 2)break;
    }

    printf("sdf\n");
    return 0;
  }
#+END_SRC

#+RESULTS:
: = 104054607

 - 26 wrong <2020-12-12 Sat 21:30>
 - 104054607 correct <2020-12-12 Sat 21:38>
** part 2
 - <2020-12-12 Sat 21:38>
#+BEGIN_SRC cpp :results output
  #include <stdio.h>
  #include <stdlib.h>
  int main() {
    long numbers[10000];
    int numbersi = 0;

    FILE *f = fopen("09.txt", "r");
    char line[100];
    while (fgets(line, sizeof(line), f)) {
      long number = atol(line);
      numbers[numbersi++] = number;
    }

    for (int i = 0; i < numbersi; i++) {
      long sum = 0;
      long min = 999999999999999;
      long max = 0;
      for (int j = i; j < numbersi; j++) {
        if (numbers[j] < min) min = numbers[j];
        if (numbers[j] > max) max = numbers[j];
        sum += numbers[j];
        if (sum == 104054607) {
        //if (sum == 127) {
          // printf(" %d..%d %d..%d\n", i, j, numbers[i], numbers[j]);
          printf("= %d\n", min + max);
          return 0;
        }
        //if (sum > 127) break;
        if (sum > 104054607) break;
      }
    }

    printf("sdf\n");
    return 0;
  }
#+END_SRC

#+RESULTS:
: = 13935797

 - 11828200 too low <2020-12-12 Sat 21:41>
 - 13935797 correct <2020-12-12 Sat 21:46>
** part 1 B
#+BEGIN_SRC cpp :results output
  #include <stdio.h>
  #include <stdlib.h>

  int adapters[200] = {0};
  int adaptersi = 0;
  int inputjolt = 0;

  void findchain(int jolt, int chain[200], int chaini) {
      //printf("## jolt=%d chaini=%d i=%d\n", jolt, chaini, adaptersi);
      if (chaini >= adaptersi) {
      //printf("##2 jolt=%d chaini=%d chainlast=%d  inputjolt=%d\n", jolt, chaini, chain[chaini-1], inputjolt);
      
              int diff1s = 0;
              int diff3s = 0;
              int curjolt = 0;
              for (int i = 0; i < chaini; i++) {
                  if (chain[i] - curjolt == 1) diff1s++;
                  if (chain[i] - curjolt == 3) diff3s++;
                  curjolt = chain[i];
              }
              printf("= %d\n", diff1s * diff3s);
              exit(0);
          return;
      }

      for (int i = 1; i <= 3; i++) {
          if (adapters[jolt+i]) {
              chain[chaini++] = jolt+i;
              findchain(jolt+i, chain, chaini);
          }
      }
  }

  int main() {
      FILE *f = fopen("10.txt", "r");
      char line[100];
      while (fgets(line, sizeof(line), f)) {
          int jolt = atoi(line);
          adapters[jolt] = 1;
          adaptersi++;
          if (jolt > inputjolt) inputjolt = jolt;
      }
      inputjolt += 3;
      adapters[inputjolt] = 1;
      adaptersi++;

      int chain[200];
      findchain(0, chain, 0);

      // for (int i = 0; i < adaptersi; i++) {
      //   printf("%d\n", adapters[i]);
      // }

      printf("sdf\n");
      return 0;
  }
#+END_SRC

#+RESULTS:
: = 2775

 - 2775 correct <2020-12-13 Sun 19:29>
** part 2
#+BEGIN_SRC cpp :results output
  #include <stdio.h>
  #include <stdlib.h>

  int adapters[200] = {0};
  int adaptersi = 0;
  int inputjolt = 0;
  int combinations = 0;

  void findchain(int jolt, int chain[200], int chaini) {
      //printf("## jolt=%d chaini=%d i=%d\n", jolt, chaini, adaptersi);
      if (chaini >= adaptersi) {
      //printf("##2 jolt=%d chaini=%d chainlast=%d  inputjolt=%d\n", jolt, chaini, chain[chaini-1], inputjolt);

              int diff1s = 0;
              int diff3s = 0;
              int curjolt = 0;
              for (int i = 0; i < chaini; i++) {
                  if (chain[i] - curjolt == 1) diff1s++;
                  if (chain[i] - curjolt == 3) diff3s++;
                  curjolt = chain[i];
              }
              combinations++;
              // printf("= %d\n", diff1s * diff3s);
              // exit(0);
          return;
      }

      for (int i = 1; i <= 3; i++) {
          if (adapters[jolt+i]) {
              chain[chaini++] = jolt+i;
              findchain(jolt+i, chain, chaini);
          }
      }
  }

  int compare(const void *aa, const void *bb) {
    int a = *(int*)aa;
    int b = *(int*)bb;

    return a < b ? -1 : a == b ? 0 : 1;
  }

  int main() {
      FILE *f = fopen("10t2.txt", "r");
      char line[100];
      adapters[adaptersi++] = 0;
      while (fgets(line, sizeof(line), f)) {
          int jolt = atoi(line);
          adapters[adaptersi++] = jolt;
          if (jolt > inputjolt) inputjolt = jolt;
      }
      inputjolt += 3;
      adapters[adaptersi++] = inputjolt;

      qsort(adapters, adaptersi, sizeof(int), compare);

      // long combinations = 1;
      // for (int i = 0; i < adaptersi; i++) {
      //   int reachable = 0;
      //   for (int j = i+1; j < adaptersi; j++) {
      //     if (adapters[j] <= adapters[i] + 3) reachable++;
      //   }
      //   if (reachable >= 2) {
      //     combinations = combinations << reachable;
      //     i += reachable-1;
      //   }
      //   printf("%d reachable=%d combinations=%ld\n", adapters[i], reachable, combinations);
      // }

      long combinations = 1;
      for (int i = adaptersi-1; i >= 0; i--) {
        int reachable = 0;
        for (int j = i-1; j >= 0; j--) {
          if (adapters[i] <= adapters[j] + 3) reachable++;
        }
        if (reachable >= 2) {
          //combinations = combinations << reachable;
          combinations *= 2;
          //i -= reachable-1;
        }
        //for (int j = 0; j < reachable-1; j++) {
        //   combinations *= 2;
        // }
        printf("%d reachable=%d combinations=%ld\n", adapters[i], reachable, combinations);
      }
      //combinations /= 2;


      printf("= %d\n", combinations);
      return 0;
  }
#+END_SRC

#+RESULTS:
#+begin_example
52 reachable=1 combinations=1
49 reachable=3 combinations=2
48 reachable=3 combinations=4
47 reachable=2 combinations=8
46 reachable=1 combinations=8
45 reachable=1 combinations=8
42 reachable=1 combinations=8
39 reachable=1 combinations=8
38 reachable=1 combinations=8
35 reachable=3 combinations=16
34 reachable=3 combinations=32
33 reachable=2 combinations=64
32 reachable=1 combinations=64
31 reachable=1 combinations=64
28 reachable=1 combinations=64
25 reachable=2 combinations=128
24 reachable=1 combinations=128
23 reachable=1 combinations=128
20 reachable=3 combinations=256
19 reachable=2 combinations=512
18 reachable=1 combinations=512
17 reachable=1 combinations=512
14 reachable=1 combinations=512
11 reachable=3 combinations=1024
10 reachable=3 combinations=2048
9 reachable=2 combinations=4096
8 reachable=1 combinations=4096
7 reachable=1 combinations=4096
4 reachable=3 combinations=8192
3 reachable=3 combinations=16384
2 reachable=2 combinations=32768
1 reachable=1 combinations=32768
0 reachable=0 combinations=32768
= 32768
#+end_example
** part 2 B
#+BEGIN_SRC cpp :results output
  #include <stdio.h>
  #include <stdlib.h>

  int adapters[200] = {0};
  int adaptersi = 0;
  int inputjolt = 0;

  long cache[300] = {-1};
 
  long combs(int jolt) {
    //printf("## jolt=%d, hasadapter=%d\n", jolt, adapters[jolt]);
    if (jolt == 0) return 1;
    if (jolt < 0 || !adapters[jolt]) return 0;
    if (cache[jolt]) return cache[jolt];
    long out = combs(jolt-1) + combs(jolt-2) + combs(jolt-3);
    cache[jolt] = out;
    return out;
  }

  int main() {
      FILE *f = fopen("10.txt", "r");
      char line[100];
      while (fgets(line, sizeof(line), f)) {
          int jolt = atoi(line);
          adapters[jolt] = 1;
          adaptersi++;
          if (jolt > inputjolt) inputjolt = jolt;
      }
      inputjolt += 3;
      adapters[inputjolt] = 1;
      adaptersi++;

      for (int i = 0; i <= inputjolt; i++) {
      //   if (adapters[i]) printf("%d\n", i);
      }

      printf("= %ld\n", combs(inputjolt));
      return 0;
  }
#+END_SRC

#+RESULTS:
: = 518344341716992

 - 518344341716992 <2020-12-13 Sun 20:22>
 - had to look up solution. Forgot about caching recursive method
** part 1
 - <2020-12-14 Mon 19:48>
#+BEGIN_SRC cpp :results output
  #include <stdio.h>
  int main() {
      FILE *f = fopen("11.txt", "r");
      char map[100][100];
      int w = 0, h = 0;

      int x = 0, y = 0;
      char line[200];
      while (fgets(line, sizeof(line), f)) {
          x = 0;
          for (int i = 0; line[i] != '\n'; i++) {
              map[y][x++] = line[i];
          }
          w = x;
          y++;
      }
      h = y;


      // for (int y = 0; y < h; y++) {
      //   for (int x = 0; x < w; x++) {
      //     printf("%c", map[y][x]);
      //   }
      //   printf("\n");
      // }

      char map2[100][100];
      for (int loops = 0; loops < 1000; loops++) {
          for (int y = 0; y < h; y++)
              for (int x = 0; x < w; x++)
                  map2[y][x] = map[y][x];

          for (int y = 0; y < h; y++) {
              for (int x = 0; x < w; x++) {
                  int neighbors = 0;
                  for (int dy = -1; dy <= 1; dy++) 
                      for (int dx = -1; dx <= 1; dx++) 
                          if (!(dx == 0 && dy == 0))
                            if (x+dx >= 0 && x+dx < w && y+dy >= 0 && y+dy < h && map2[y+dy][x+dx] == '#')
                              neighbors++;
                  if (map2[y][x] == 'L' && neighbors == 0)
                      map[y][x] = '#';
                  else if (map2[y][x] == '#' && neighbors >= 4)
                      map[y][x] = 'L';
              }
          }

          // printf("\n\n");
          // for (int y = 0; y < h; y++) {
          //     for (int x = 0; x < w; x++) {
          //         printf("%c", map[y][x]);
          //     }
          //     printf("\n");
          // }

          int equal = 1;
          for (int y = 0; y < h; y++)
              for (int x = 0; x < w; x++)
                if (map[y][x] != map2[y][x]) {
                  equal = 0;
                  break;
                }
          if (equal) break;
      }

      int occupied = 0;
      for (int y = 0; y < h; y++) 
        for (int x = 0; x < w; x++) 
          if (map[y][x] == '#')
            occupied++;


      printf("= %d\n", occupied);
      return 0;
  }
#+END_SRC

#+RESULTS:
: = 2238


 - 172 too low <2020-12-14 Mon 20:02>
 - 2238 correct <2020-12-14 Mon 20:05>
** part 2
#+BEGIN_SRC cpp :results output
  #include <stdio.h>
  int main() {
      FILE *f = fopen("11.txt", "r");
      char map[100][100];
      int w = 0, h = 0;

      int x = 0, y = 0;
      char line[200];
      while (fgets(line, sizeof(line), f)) {
          x = 0;
          for (int i = 0; line[i] != '\n'; i++) {
              map[y][x++] = line[i];
          }
          w = x;
          y++;
      }
      h = y;


      // for (int y = 0; y < h; y++) {
      //   for (int x = 0; x < w; x++) {
      //     printf("%c", map[y][x]);
      //   }
      //   printf("\n");
      // }

      char map2[100][100];
      for (int loops = 0; loops < 1000; loops++) {
          for (int y = 0; y < h; y++)
              for (int x = 0; x < w; x++)
                  map2[y][x] = map[y][x];

          for (int y = 0; y < h; y++) {
              for (int x = 0; x < w; x++) {
                  int neighbors = 0;
                  for (int dy = -1; dy <= 1; dy++) 
                      for (int dx = -1; dx <= 1; dx++)
                          if (!(dx == 0 && dy == 0)) {
                            int x0 = x+dx;
                            int y0 = y+dy;
                            while (x0 >= 0 && x0 < w && y0 >= 0 && y0 < h) {
                              if (map2[y0][x0] == 'L')
                                break;
                              if (map2[y0][x0] == '#') {
                                neighbors++;
                                break;
                              }
                              x0+=dx;
                              y0+=dy;
                            }
                          }
                  if (map2[y][x] == 'L' && neighbors == 0)
                      map[y][x] = '#';
                  else if (map2[y][x] == '#' && neighbors >= 5)
                      map[y][x] = 'L';
              }
          }

          // printf("\n\n");
          // for (int y = 0; y < h; y++) {
          //     for (int x = 0; x < w; x++) {
          //         printf("%c", map[y][x]);
          //     }
          //     printf("\n");
          // }

          int equal = 1;
          for (int y = 0; y < h; y++)
              for (int x = 0; x < w; x++)
                if (map[y][x] != map2[y][x]) {
                  equal = 0;
                  break;
                }
          if (equal) break;
      }

      int occupied = 0;
      for (int y = 0; y < h; y++) 
        for (int x = 0; x < w; x++) 
          if (map[y][x] == '#')
            occupied++;


      printf("= %d\n", occupied);
      return 0;
  }
#+END_SRC

#+RESULTS:
: = 2013

 - 2013 correct <2020-12-14 Mon 20:10>
 
** part 1
 - <2020-12-15 Tue 18:30>
#+BEGIN_SRC cpp :results output
#include <stdio.h>
#include <stdlib.h>
int main() {
  FILE *f = fopen("12.txt", "r");
  char line[100];
  int x = 0;
  int y = 0;
  int rotation = 90;
  while (fgets(line, sizeof(line), f)) {
    int val = atoi(line+1);
    switch (line[0]) {
      case 'N': y+=val; break;
      case 'S': y-=val; break;
      case 'W': x-=val; break;
      case 'E': x+=val; break;
      case 'F': 
        switch (rotation) {
        case 0: y+=val; break;
        case 90: x+=val; break;
        case 180: y-=val; break;
        case 270: x-=val; break;
        default: printf("## ! %d (%d)\n", rotation, val); return 0;
        }
        break;
      case 'L': rotation = (360+rotation-val) % 360; break;
      case 'R': rotation = (360+rotation+val) % 360; break;
      default: printf("##2\n"); return 0;
    }
    //printf("%d,%d  r=%d  '%s'", x, y, rotation, line);
  }

  printf("= %d\n", abs(x) + abs(y));
  return 0;
}
#+END_SRC

#+RESULTS:
: = 2847

 - 581 too low <2020-12-15 Tue 18:41>
 - 2847 correct <2020-12-15 Tue 18:43>
** part 2
#+BEGIN_SRC cpp :results output
#include <stdio.h>
#include <stdlib.h>
int main() {
  FILE *f = fopen("12.txt", "r");
  char line[100];
  int sx = 0;
  int sy = 0;
  int x = 10;
  int y = 1;
  while (fgets(line, sizeof(line), f)) {
    int val = atoi(line+1);
    switch (line[0]) {
      case 'N': y+=val; break;
      case 'S': y-=val; break;
      case 'W': x-=val; break;
      case 'E': x+=val; break;
      case 'F': 
        sx+=x*val;
        sy+=y*val;
        break;
      case 'L': 
      while (val > 0) {
        int tmp = y;
        y = x;
        x = -tmp;
        val -= 90;
      }
      break;
      case 'R': 
      while (val > 0) {
        for (int i = 0; i < 3; i++) {
        int tmp = y;
        y = x;
        x = -tmp;
        }
        val -= 90;
      }
      break;
      default: printf("##2\n"); return 0;
    }
    //printf("s=%d,%d w=%d,%d  '%s'", sx, sy, x, y, line);
  }

  printf("= %d\n", abs(sx) + abs(sy));
  return 0;
}
#+END_SRC

#+RESULTS:
: = 29839

 - 29839 correct <2020-12-15 Tue 18:52>
** part 1
 - <2020-12-15 Tue 19:12>
#+BEGIN_SRC cpp :results output
  #include <stdio.h>
  #include <stdlib.h>
  int main() {
    FILE *f = fopen("13.txt", "r");
    char line[1024];
    fgets(line, sizeof(line), f);
    int depart = atoi(line);
    fgets(line, sizeof(line), f);
    char *ptr = line;

    int times[1000];
    int timesi = 0;

    for (int i = 0; line[i]; i++) {
      if (line[i] == ',' || line[i+1] == 0) {
        //printf("##1 '%s'\n##2 '%s'\n", ptr, line+i);
        line[i++] = 0;
        if (ptr[0] != 'x') {
          int time = atoi(ptr);
          times[timesi++] = time;
        }
        ptr = line+i;
      }
    }
    timesi--;

    // for (int i = 0; i < timesi; i++) {
    //   printf("%d\n", times[i]);
    // }

    int earliestbus = 0;
    int earliesttime = 999999;
    for (int i = 0; i < timesi; i++) {
     int time = ((depart / times[i])+1) * times[i];
     printf("%d t=%d %d\n", times[i], time, time-depart);
     if (time >= depart) {
        if (time-depart < earliesttime) {
          earliesttime = time-depart;
          earliestbus = times[i];
        }
      }
    }

    printf("= %d\n", earliesttime * earliestbus);
    return 0;
  }
#+END_SRC

#+RESULTS:
#+begin_example
13 t=1001299 12
37 t=1001294 7
461 t=1001292 5
17 t=1001300 13
19 t=1001300 13
29 t=1001312 25
739 t=1001345 58
41 t=1001302 15
23 t=1001305 18
= 2305
#+end_example

 - 2305 correct <2020-12-15 Tue 19:28>

** part 2
#+BEGIN_SRC cpp :results output
  #include <stdio.h>
  #include <stdlib.h>
  int main() {
    FILE *f = fopen("13.txt", "r");
    char line[1024];
    fgets(line, sizeof(line), f);
    int depart = atoi(line);
    fgets(line, sizeof(line), f);
    char *ptr = line;

    int times[1000];
    int timesi = 0;

    for (int i = 0; line[i]; i++) {
      if (line[i] == ',' || line[i+1] == 0) {
        //printf("##1 '%s'\n##2 '%s'\n", ptr, line+i);
        line[i++] = 0;
        int time = -1;
        if (ptr[0] != 'x') {
          time = atoi(ptr);
        }
        times[timesi++] = time;
        ptr = line+i;
      }
    }
    timesi--;

    long firstt = -1;
    int firsttimesi = 0;
    for (int i = 0; i < timesi; i++) {
      if (times[i] != -1) {
        firstt = times[i];
        firsttimesi = i;
        break;
      }
    }

    int ii = 0;
    for (int i = firsttimesi+1; i < timesi; i++) {
      if (times[i] != -1)
        //printf("t*%d + %d = %c*%d and ", times[firsttimesi], i, 'a'+ii++, times[i]);
        printf("t*%d mod %d = %d and ", times[firsttimesi], times[i], i);
    }
    printf("\n");
    return 0;

    // t*17



    while (true) {
      firstt += times[firsttimesi];
      int works = 1;
      for (int i = firsttimesi+1; i < timesi; i++) {
        if (times[i] == -1) continue;
          long time = ((firstt / times[i])+1) * times[i];
          if (time - i != firstt) { works = 0; break; }
       }
      if (works) { printf("= %ld %d\n", firstt, firstt/times[firsttimesi]); break; }
    }
    return 0;
  }
#+END_SRC

#+RESULTS:
: t*13 mod 37 = 7 and t*13 mod 461 = 13 and t*13 mod 17 = 27 and t*13 mod 19 = 32 and t*13 mod 29 = 42 and t*13 mod 739 = 44 and t*13 mod 41 = 54 and t*13 mod 23 = 67 and

** part 2 C
#+BEGIN_SRC cpp :results output
  #include <stdio.h>
  #include <stdlib.h>
  int main() {
    FILE *f = fopen("13.txt", "r");
    char line[1024];
    fgets(line, sizeof(line), f);
    int depart = atoi(line);
    fgets(line, sizeof(line), f);
    char *ptr = line;

    int times[1000];
    int timesi = 0;

    for (int i = 0; line[i]; i++) {
      if (line[i] == ',' || line[i+1] == 0) {
        //printf("##1 '%s'\n##2 '%s'\n", ptr, line+i);
        line[i++] = 0;
        int time = -1;
        if (ptr[0] != 'x') {
          time = atoi(ptr);
        }
        times[timesi++] = time;
        ptr = line+i;
      }
    }
    timesi--;

    long t = 0;
    long add = 1;
    for (int i = 0; i < timesi; i++) {
      if (times[i] != -1) {
        while (((t+i) % times[i]) != 0) {
          t += add;
        }
        printf("## t=%ld, add=%ld,  i=%d,  time=%d\n", t, add, i, times[i]);
        add *= times[i];
      }
    }

    printf("= %ld\n", t);

    return 0;
  }
#+END_SRC

#+RESULTS:
#+begin_example
## t=0, add=1,  i=0,  time=13
## t=104, add=13,  i=7,  time=37
## t=185770, add=481,  i=13,  time=461
## t=850993, add=221741,  i=27,  time=17
## t=19698978, add=3769597,  i=32,  time=19
## t=1165656466, add=71622343,  i=42,  time=29
## t=34398423618, add=2077047947,  i=44,  time=739
## t=49152428274274, add=1534938432833,  i=54,  time=41
## t=552612234243498, add=62932475746153,  i=67,  time=23
= 552612234243498
#+end_example

 - 552612234243498 correct <2020-12-15 Tue 21:15>
 - looked at other solution at https://gist.github.com/joshbduncan/65f810fe821c7a3ea81a1f5a444ea81e
** part 1
 - <2020-12-16 Wed 19:21>
#+BEGIN_SRC cpp :results output
#include <stdio.h>
#include <stdlib.h>
#include <stdint.h>
#include <string.h>
int main() {
  FILE *f = fopen("14.txt", "r");
  char line[300];
  long memval[1000] = {0};
  int memvali = 0;
  long mask1s = 0;
  long mask0s = 0;
  while (fgets(line, sizeof(line), f)) {
    //printf("'%s'", line);
    if (0 == strncmp("mask", line, strlen("mask"))) {
      char *ptr = index(line, '=') + 2;
      mask1s = mask0s = 0;
      for (int i = 0; ptr[i] != '\n'; i++) {
        mask1s *= 2;
        mask0s *= 2;
        switch (ptr[i]) {
        case '1': mask1s += 1; break;
        case '0': mask0s += 1; break;
        }
        //printf("i=%d %c 1s=%ld, 0s=%ld\n", i,ptr[i], mask1s, mask0s);
      }
      //printf("mask='%s' 1s=%lx, 0s=%lx\n", ptr, mask1s, mask0s);
    } else {
      long m = 0;
      long val = 0;
      m = atol(line+strlen("mem["));
      val = atol(index(line, '=')+2);
      //printf("a %ld = %ld\n", m, val);
      //m = (m | mask1s) & ~mask0s;
      val = (val | mask1s) & ~mask0s;
      //printf("b %ld = %ld\n", m, val);
      int updated = 0;
      for (int i = 0; i < memvali; i+=2) {
        if (memval[i] == m) {
          memval[i+1] = val;
          updated = 1;
          break;
        }
      }
      if (!updated) {
        memval[memvali++] = m;
        memval[memvali++] = val;
      }
    }
  }
  //printf("memvali=%d\n", memvali);

  long long  sum = 0;
  for (int i = 0; i < memvali; i+=2) {
    sum += memval[i+1];
  }

  printf(" = %ld\n", sum);
  return 0;
  /*
100110X100000XX0X100X1100110X001X100
100110010000000001000110011000010100 41070913044 990046614
011001001111100100110001100101100011 27104844131 64F931963
*/
}
#+END_SRC

#+RESULTS:
: = 10452688630537

 - 676326698152 too low <2020-12-16 Wed 19:45>
 - 9429470047400 too low <2020-12-16 Wed 19:47>
 - 10452688630537 correct <2020-12-16 Wed 20:12>
** part 2
#+BEGIN_SRC cpp :results output
  #include <stdio.h>
  #include <stdlib.h>
  #include <stdint.h>
  #include <string.h>
  long memval[1000000] = {0};
  int memvali = 0;
  void setval(long m, long val) {
    //printf("## setval(%ld, %ld)\n", m, val);
    if (m < 0) exit(0);
        for (int i = 0; i < memvali; i+=2) {
          if (memval[i] == m) {
            memval[i+1] = val;
            return;
          }
        }
        if (memvali+2 >= sizeof(memval)/sizeof(long)) { printf("! %d\n", memvali); exit(0); }
        //printf("## new %ld=%ld\n", m, val);
          memval[memvali++] = m;
          memval[memvali++] = val;
  }
  void write(long m, long val, long maskxs) {
    long m1 = -1;
    long m2 = -1;
    int founds = 0;
    for (long i = 40; i >= 0; i--) {
      if (maskxs & (1L<<i)) {
        if (founds == 1) return;
        //printf("### i=%ld, m=%ld, val=%ld\n", i, m, val);
        maskxs = maskxs & ~(1L<<i);
        m1 = m | (1L<<i);
        m2 = m & ~(1L<<i);
        if (m1 < 0|| m2 < 0) printf("##z m=%ld m1=%ld m2=%ld i=%ld\n", m, m1, m2, i);
        write(m2, val, maskxs);
        write(m1, val, maskxs);
        founds++;
      }
    }
    if (m1 != -1) {
      setval(m2, val);
      setval(m1, val);
    }
  }
  int main() {

    if (false) {
      long m = 907312317;
      long i = 31;
      long m1 = (long) m | (long)(1L<<i);
      printf("##1 m=%ld, i=%ld m1=%ld i2=%ld\n", m, m1, i, 1<<i);
      return 0;
    }

    FILE *f = fopen("14.txt", "r");
    char line[300];
    long mask1s = 0;
    long mask0s = 0;
    long maskxs = 0;
    while (fgets(line, sizeof(line), f)) {
      //printf("'%s'", line);
      if (0 == strncmp("mask", line, strlen("mask"))) {
        char *ptr = index(line, '=') + 2;
        mask1s = mask0s = maskxs = 0;
        for (int i = 0; ptr[i] != '\n'; i++) {
          mask1s *= 2;
          mask0s *= 2;
          maskxs *= 2;
          switch (ptr[i]) {
          case '1': mask1s += 1; break;
          case '0': mask0s += 1; break;
          case 'X': maskxs += 1; break;
          }
          //printf("i=%d %c 1s=%ld, 0s=%ld\n", i,ptr[i], mask1s, mask0s);
        }
        //printf("mask='%s' 1s=%ld, 0s=%ld, xs=%ld\n", ptr, mask1s, mask0s, maskxs);
      } else {
        long m = 0;
        long val = 0;
        m = atol(line+strlen("mem["));
        val = atol(index(line, '=')+2);
        //printf("a %ld = %ld\n", m, val);
        m = m | mask1s;
        //val = (val | mask1s) & ~mask0s;
        //printf("b %ld = %ld\n", m, val);
        write(m, val, maskxs);
      }
    }

    long sum = 0;
    for (int i = 0; i < memvali; i+=2) {
      sum += memval[i+1];
    }

    printf(" = %ld\n", sum);
    return 0;
  }
#+END_SRC

#+RESULTS:
: = 2881082759597

 - 2984132033968 too high <2020-12-16 Wed 20:34>
 - 2330121756417 too low <2020-12-16 Wed 20:51>
 - 2881082759597 correct <2020-12-16 Wed 21:05>
